<img src="../Img/Python_SQL_PI.png" style="width:100%">


<p style="font-size:22px;text-align:center">Семинар 4.1. Подзапросы</p> 

<a id = Home></a>

17 марта 2022 года, пн<br>
Поток: ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (2 подгруппа)<br>


21 марта 2022 года, чт<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (3 подгруппа)<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (4 подгруппа)<br>

31 марта 2022 года, чт<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6 (1 подгруппа)


```
STUDENT
STUDENT_ID — числовой код, идентифицирующий студента (идентификатор студента),
SURNAME — фамилия студента,
NAME — имя студента,
STIPEND — стипендия, которую получает студент,
KURS — курс, на котором учится студент,
CITY — город, в котором живет студент,
BIRTHDAY — дата рождения студента,
UNIV_ID — идентификатор университета, в котором учится студент.


LECTURER
LECTURER_ID — идентификатор преподавателя,
SURNAME — фамилия преподавателя,
NAME — имя преподавателя,
CITY — город, в котором живет преподаватель,
UNIV_ID — идентификатор университета, в котором работает преподаватель


SUBJECT
SUBJ_ID — идентификатор предмета обучения,
SUBJ_NAME — наименование предмета обучения,
HOUR — количество часов, отводимых на изучение предмета,
SEMESTER — семестр, в котором изучается данный предмет.


UNIVERSITY
UNIV_ID — идентификатор университета,
UNIV_NAME — название университета,
RATING — рейтинг университета,
CITY — город, в котором расположен университет.


EXAM_MARKS
EXAM_ID — идентификатор экзамена,
STUDENT_ID — идентификатор студента,
SUBJ_ID — идентификатор предмета обучения,
MARK — экзаменационная оценка,
EXAM_DATE — дата экзамена.


SUBJ_LECT
LECTURER_ID — идентификатор преподавателя,
SUBJ_ID — идентификатор предмета обучения.
```

<img src="../Img/Students_Schema.png" style="width:60%">

<img src=../Img/pencil.png style="width:190px;height:190px">
<p style="background-color:powderblue; font-size:125%; color: rebeccapurple;">Выполните задания</p>
<p>Выполните задания в Jupyter Notebook</p>

1. С помощью подзапроса напишите запрос, выводящий список студентов, получающих максимальную стипендию, отсортировав его в алфавитном порядке по фамилиям.
2. С помощью подзапроса напишите запрос, выводящий список студентов, получающих стипендию, превышающую среднее значение стипендии.
3. С помощью подзапроса напишите запрос, выводящий список студентов, обучающихся в Воронеже, с последующей сортировкой по идентификаторам университетов и курсам.
4. С помощью подзапроса напишите запрос, выводящий список предметов, на изучение которых отведено максимальное количество часов.
5. Напишите запрос, выполняющий вывод имен и фамилий студентов, место проживания которых не совпадает с городом, в котором находится их университет.
6. С помощью подзапроса напишите запрос, выводящий список университетов, расположенных в Москве и имеющих рейтинг больший, чем у ВГУ.

In [1]:
#! pip install sqlalchemy

In [8]:
import sqlite3
conn2 = sqlite3.connect(r"Lect_Students.db")
def select_all_tables(conn, sql_sent):
    
    cursor = conn.execute(sql_sent)
    
    rows = cursor.fetchall()
    
    if len(rows) == 0:
        print("По такому запросу данных в БД нет.")
        return 0
    
    len_elm = [max([len(str(row[el])) for row in rows]) for el in range(len(rows[0]))]
    answer_len = 4+(len(len_elm)-1)*3+sum(len_elm)
    
    print("—"*answer_len)
        
    for index in range(len(rows)):
        row = rows[index]
        print("|", end='')
        for elem in range(len(row)):
            print(" " + str(row[elem]).ljust(len_elm[elem]) + " |", end='')
        print()
    print("—"*answer_len)

In [7]:
from sqlalchemy import MetaData, Table, create_engine, select, and_, or_, not_
from sqlalchemy.sql import func

In [8]:
engine = create_engine('sqlite:///../Data/Students.db')
metadata_obj = MetaData() # Объект-контейнер, содержит информацию о схеме данных
metadata_obj.reflect(bind=engine) # Отображение БД
# Вызов метода reflect() приводит к включению в объект metadata_obj словаря всех таблиц БД.

Несколько примеров получения информации о БД с помощью методов объекта ***metadata_obj***.

In [9]:
# Таблицы в БД
metadata_obj.tables.keys()

dict_keys(['city', 'exam_marks', 'student', 'university', 'subject', 'lecturer', 'subj_lect'])

In [10]:
# Имя конкретной таблицы
metadata_obj.tables['student'].name

'student'

In [11]:
# Столбцы конкретной таблицы
metadata_obj.tables['student'].columns.keys()

['student_id',
 'surname',
 'name',
 'stipend',
 'kurs',
 'city',
 'birthday',
 'univ_id']

In [12]:
# Информация о столбце
metadata_obj.tables['student'].columns['student_id']

Column('student_id', INTEGER(), table=<student>, primary_key=True, nullable=False)

In [13]:
for t in metadata_obj.sorted_tables:
    print(t.name)

city
subject
university
lecturer
student
exam_marks
subj_lect

In [14]:
for t in metadata_obj.sorted_tables:
    print(t.name)
    for c in t.columns:
        print(c)
    print()

city
city.city_id
city.name

subject
subject.subj_id
subject.subj_name
subject.hour
subject.semester

university
university.univ_id
university.univ_name
university.rating
university.city

lecturer
lecturer.lecturer_id
lecturer.surname
lecturer.name
lecturer.city
lecturer.univ_id

student
student.student_id
student.surname
student.name
student.stipend
student.kurs
student.city
student.birthday
student.univ_id

exam_marks
exam_marks.exam_id
exam_marks.student_id
exam_marks.subj_id
exam_marks.mark
exam_marks.exam_date

subj_lect
subj_lect.lecturer_id
subj_lect.subj_id

Создание объектов таблиц

In [17]:
exam_marks=Table("exam_marks", metadata_obj, autoload=True, autoload_with="engine")
lecturer=Table("lecturer", metadata_obj, autoload=True, autoload_with="engine")
student=Table("student", metadata_obj, autoload=True, autoload_with="engine")
subj_lect=Table("subj_lect", metadata_obj, autoload=True, autoload_with="engine")
subject=Table("subject", metadata_obj, autoload=True, autoload_with="engine")
university=Table("university", metadata_obj, autolad=True, autolad_with="engine")

# Решение

In [16]:
conn=engine.connect() # Соединение

In [50]:
# Ваш код здесь

'''
1 С помощью подзапроса напишите запрос,
выводящий список студентов, получающих максимальную стипендию, отсортировав его в алфавитном порядке по фамилиям.
'''
sq = select(func.max(student.c.stipend)).scalar_subquery()

s = select(student)
s = s.where(student.c.stipend == sq)
s = s.order_by(student.c.surname)

print(s)


result = conn.execute(s).fetchall()
print(len(result))
select_all_tables(conn, s)

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE student.stipend = (SELECT max(student.stipend) AS max_1
FROM student) ORDER BY student.surname
18
—————————————————————————————————————————————————————————————————————————————————————————————
| 55  | Белкин     | Вадим      | 250 | 5 | Воронеж              | 2000-01-07 00:00:00 | 10 |
| 91  | Блохина    | Ираида     | 250 | 3 | Новый Уренгой        | 1997-03-23 00:00:00 | 22 |
| 149 | Вячеслав   | Пахомов    | 250 | 3 | Игарка               | 1997-05-14 00:00:00 | 14 |
| 141 | Ершов      | Митрофан   | 250 | 5 | Пятигорск            | 2001-05-28 00:00:00 | 22 |
| 64  | Жук        | Оксана     | 250 | 1 | Воркута              | 2000-11-16 00:00:00 | 47 |
| 12  | Зайцева    | Ольга      | 250 | 2 | Липецк               | 2001-05-01 00:00:00 | 10 |
| 68  | Казакова   | Ольга      | 250 | 4 | Кемерово             | 2000-03-29 00:00:00 | 44 |
| 130 | Кудряшов   | Роман      | 250 | 4 | Нижний Новгород      | 1997-08-26 00:00:00 | 32 |
| 92  | Мельникова | Светлана   | 250 | 4 | Кропоткин (Краснод.) | 1998-03-24 00:00:00 | 15 |
| 107 | Морозов    | Кирилл     | 250 | 2 | Кропоткин (Краснод.) | 2000-09-29 00:00:00 | 44 |
| 66  | Некрасова  | Вероника   | 250 | 2 | Иркутск              | 2004-08-23 00:00:00 | 10 |
| 114 | Панов      | Арсений    | 250 | 1 | Геленджик            | 1996-12-23 00:00:00 | 32 |
| 204 | Петров     | Вадим      | 250 | 2 | Брянск               | 2002-05-21 00:00:00 | 44 |
| 203 | Петрова    | Екатерина  | 250 | 4 | Белгород             | 2001-05-21 00:00:00 | 14 |
| 72  | Пономарева | Алина      | 250 | 2 | Ангарск              | 2002-10-07 00:00:00 | 48 |
| 146 | Русаков    | Давид      | 250 | 2 | Байкальск            | 1998-08-07 00:00:00 | 47 |
| 110 | Суханов    | Константин | 250 | 3 | Курск                | 1996-11-22 00:00:00 | 14 |
| 103 | Трофимов   | Владислав  | 250 | 5 | Верхоянск            | 1995-03-24 00:00:00 | 11 |
—————————————————————————————————————————————————————————————————————————————————————————————

In [ ]:
SELECT * FROM student
    where stipend = (
    select max(stipend) from student)
    order by surname;

In [43]:
'''
2 С помощью подзапроса напишите запрос,
выводящий список студентов, получающих стипендию, превышающую среднее значение стипендии.
'''
sq = select(func.avg(student.c.stipend)).scalar_subquery()

s = select(student.c.surname, student.c.name, func.date(student.c.birthday), student.c.stipend)
s = s.where(student.c.stipend > sq)
s = s.order_by(student.c.surname)

print(s)


result = conn.execute(s).fetchall()
print(len(result))
select_all_tables(conn, s)

SELECT student.surname, student.name, date(student.birthday) AS date_1, student.stipend
FROM student
WHERE student.stipend > (SELECT avg(student.stipend) AS avg_1
FROM student) ORDER BY student.surname
60
———————————————————————————————————————————————
| Агафонов   | Василий     | 1994-10-29 | 150 |
| Аксенов    | Валерий     | 1994-10-27 | 150 |
| Архипов    | Андрей      | 2000-01-28 | 180 |
| Баранов    | Александр   | 2001-08-18 | 220 |
| Белкин     | Вадим       | 2000-01-07 | 250 |
| Блохина    | Ираида      | 1997-03-23 | 250 |
| Борисова   | Марина      | 1995-08-07 | 150 |
| Валерия    | Овчинникова | 2000-06-15 | 200 |
| Веселов    | Тимур       | 1998-04-28 | 150 |
| Вишнякова  | Анжела      | 2002-02-10 | 200 |
| Владимиров | Анатолий    | 2003-05-21 | 200 |
| Вячеслав   | Пахомов     | 1997-05-14 | 250 |
| Гуляев     | Кузьма      | 1999-10-13 | 150 |
| Дуб        | Елизавета   | 2004-07-04 | 150 |
| Ершов      | Митрофан    | 2001-05-28 | 250 |
| Ефимов     | Яков        | 2000-09-23 | 200 |
| Жданова    | Ирина       | 2002-03-02 | 200 |
| Жук        | Оксана      | 2000-11-16 | 250 |
| Жукова     | Фекла       | 1998-10-06 | 150 |
| Жуковский  | Юрий        | 1996-05-30 | 150 |
| Журавлев   | Фома        | 1997-07-12 | 200 |
| Зайцева    | Ольга       | 2001-05-01 | 250 |
| Захаров    | Софон       | 1994-03-19 | 150 |
| Иванов     | Иван        | 2002-12-03 | 150 |
| Иванова    | Мария       | 2002-04-11 | 200 |
| Казакова   | Ольга       | 2000-03-29 | 250 |
| Казакова   | Мария       | 1994-02-18 | 150 |
| Калашников | Евгений     | 1998-02-27 | 200 |
| Киселев    | Владимир    | 2003-02-10 | 210 |
| Ковалев    | Ефим        | 1995-11-28 | 200 |
| Кондрат    | Синицин     | 2001-02-23 | 200 |
| Кондратьев | Николай     | 1999-10-28 | 150 |
| Котов      | Павел       | 2001-02-28 | 150 |
| Кудряшов   | Роман       | 1997-08-26 | 250 |
| Кулаков    | Феофан      | 2001-03-14 | 150 |
| Лапина     | Элеонора    | 1997-11-23 | 150 |
| Лукин      | Артем       | 2001-12-01 | 200 |
| Мельникова | Светлана    | 1998-03-24 | 250 |
| Миронова   | Анна        | 2000-10-08 | 200 |
| Миронова   | Федор       | 2002-04-15 | 200 |
| Мишина     | Светлана    | 1997-05-22 | 150 |
| Морозов    | Кирилл      | 2000-09-29 | 250 |
| Назаров    | Икром       | 2001-12-15 | 150 |
| Некрасова  | Вероника    | 2004-08-23 | 250 |
| Панов      | Арсений     | 1996-12-23 | 250 |
| Петров     | Петр        | 2000-12-01 | 200 |
| Петров     | Вадим       | 2002-05-21 | 250 |
| Петров     | Антон       | 2001-08-05 | 200 |
| Петрова    | Екатерина   | 2001-05-21 | 250 |
| Пономарев  | Варфоромей  | 2000-12-15 | 200 |
| Пономарева | Алина       | 2002-10-07 | 250 |
| Русаков    | Давид       | 1998-08-07 | 250 |
| Сидоров    | Вадим       | 1999-06-07 | 150 |
| Ситников   | Викентий    | 2003-10-05 | 150 |
| Сорокина   | Ирина       | 1993-09-28 | 200 |
| Сорокина   | Валерия     | 1995-03-01 | 150 |
| Суханов    | Константин  | 1996-11-22 | 250 |
| Тимофеева  | Фаина       | 1999-08-01 | 150 |
| Трофимов   | Владислав   | 1995-03-24 | 250 |
| Ширяев     | Андрей      | 1997-09-13 | 150 |
———————————————————————————————————————————————

In [ ]:
SELECT surname, name, birthday, stipend FROM student
    where stipend > (
    select avg(stipend) from student)
    order by surname;

In [45]:
'''
3 С помощью подзапроса напишите запрос,
выводящий список студентов, обучающихся в Воронеже, с последующей сортировкой по идентификаторам университетов и курсам.
'''
sq = select(university.c.univ_id).scalar_subquery()
sq = sq.where(university.c.city == "Воронеж")

s = select(student)
s = s.where(student.c.univ_id.in_(sq))
s = s.order_by(student.c.univ_id)

print(s)


result = conn.execute(s).fetchall()
print(len(result))
select_all_tables(conn, s)

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE student.univ_id IN (SELECT university.univ_id
FROM university
WHERE university.city = :city_1) ORDER BY student.univ_id
22
———————————————————————————————————————————————————————————————————————————————————————
| 1   | Иванов     | Иван        | 150 | 1 | Орел          | 2002-12-03 00:00:00 | 10 |
| 3   | Петров     | Петр        | 200 | 3 | Курск         | 2000-12-01 00:00:00 | 10 |
| 10  | Кузнецов   | Борис       | 0   | 2 | Брянск        | 2001-12-08 00:00:00 | 10 |
| 12  | Зайцева    | Ольга       | 250 | 2 | Липецк        | 2001-05-01 00:00:00 | 10 |
| 55  | Белкин     | Вадим       | 250 | 5 | Воронеж       | 2000-01-07 00:00:00 | 10 |
| 62  | Семенова   | Вероника    | 0   | 3 | Вологда       | 2003-10-04 00:00:00 | 10 |
| 65  | Сергеева   | Фёкла       | 100 | 5 | None          | 2000-02-19 00:00:00 | 10 |
| 66  | Некрасова  | Вероника    | 250 | 2 | Иркутск       | 2004-08-23 00:00:00 | 10 |
| 76  | Мельникова | Дарья       | 100 | 5 | Архангельск   | 2002-08-01 00:00:00 | 10 |
| 78  | Агафонов   | Василий     | 150 | 1 | Грозный       | 1994-10-29 00:00:00 | 10 |
| 88  | Жданова    | Ирина       | 200 | 3 | Тверь         | 2002-03-02 00:00:00 | 10 |
| 99  | Борисова   | Марина      | 150 | 1 | Рославль      | 1995-08-07 00:00:00 | 10 |
| 113 | Аксенов    | Валерий     | 150 | 1 | Мурманск      | 1994-10-27 00:00:00 | 10 |
| 116 | Федоров    | Гостомысл   | 100 | 4 | Новый Уренгой | 2000-11-16 00:00:00 | 10 |
| 265 | Павлов     | Андрей      | 0   | 3 | Воронеж       | 2000-11-05 00:00:00 | 10 |
| 654 | Лукин      | Артем       | 200 | 3 | Воронеж       | 2001-12-01 00:00:00 | 10 |
| 61  | Соколова   | Ия          | 100 | 1 | Колпашево     | 2002-06-25 00:00:00 | 18 |
| 71  | Кондрат    | Синицин     | 200 | 4 | Ишим          | 2001-02-23 00:00:00 | 18 |
| 77  | Мишина     | Светлана    | 150 | 2 | Рыльск        | 1997-05-22 00:00:00 | 18 |
| 89  | Валерия    | Овчинникова | 200 | 5 | Улан-Удэ      | 2000-06-15 00:00:00 | 18 |
| 124 | Юдин       | Савва       | 0   | 2 | Усинск        | 2001-12-02 00:00:00 | 18 |
| 139 | Журавлев   | Фома        | 200 | 2 | Улан-Удэ      | 1997-07-12 00:00:00 | 18 |
———————————————————————————————————————————————————————————————————————————————————————

In [ ]:
SELECT * FROM student
    where univ_id in (
    select univ_id from university where city = 'Воронеж')
    order by univ_id;

In [48]:
'''
5 Напишите запрос, выполняющий вывод имен и фамилий студентов,
место проживания которых не совпадает с городом, в котором находится их университет.
'''
sq = select(university.c.city)
sq = sq.where(university.c.univ_id == student.c.univ_id).scalar_subquery()


s = select(student)
s = s.where(student.c.univ_id != sq)
s = s.order_by(student.c.univ_id)

print(s)


result = conn.execute(s).fetchall()
print(len(result))
select_all_tables(conn, s)

SELECT student.student_id, student.surname, student.name, student.stipend, student.kurs, student.city, student.birthday, student.univ_id
FROM student
WHERE student.univ_id != (SELECT university.city
FROM university
WHERE university.univ_id = student.univ_id) ORDER BY student.univ_id
89
——————————————————————————————————————————————————————————————————————————————————————————————
| 1   | Иванов     | Иван        | 150 | 1 | Орел                 | 2002-12-03 00:00:00 | 10 |
| 3   | Петров     | Петр        | 200 | 3 | Курск                | 2000-12-01 00:00:00 | 10 |
| 10  | Кузнецов   | Борис       | 0   | 2 | Брянск               | 2001-12-08 00:00:00 | 10 |
| 12  | Зайцева    | Ольга       | 250 | 2 | Липецк               | 2001-05-01 00:00:00 | 10 |
| 55  | Белкин     | Вадим       | 250 | 5 | Воронеж              | 2000-01-07 00:00:00 | 10 |
| 62  | Семенова   | Вероника    | 0   | 3 | Вологда              | 2003-10-04 00:00:00 | 10 |
| 65  | Сергеева   | Фёкла       | 100 | 5 | None                 | 2000-02-19 00:00:00 | 10 |
| 66  | Некрасова  | Вероника    | 250 | 2 | Иркутск              | 2004-08-23 00:00:00 | 10 |
| 76  | Мельникова | Дарья       | 100 | 5 | Архангельск          | 2002-08-01 00:00:00 | 10 |
| 78  | Агафонов   | Василий     | 150 | 1 | Грозный              | 1994-10-29 00:00:00 | 10 |
| 88  | Жданова    | Ирина       | 200 | 3 | Тверь                | 2002-03-02 00:00:00 | 10 |
| 99  | Борисова   | Марина      | 150 | 1 | Рославль             | 1995-08-07 00:00:00 | 10 |
| 113 | Аксенов    | Валерий     | 150 | 1 | Мурманск             | 1994-10-27 00:00:00 | 10 |
| 116 | Федоров    | Гостомысл   | 100 | 4 | Новый Уренгой        | 2000-11-16 00:00:00 | 10 |
| 265 | Павлов     | Андрей      | 0   | 3 | Воронеж              | 2000-11-05 00:00:00 | 10 |
| 654 | Лукин      | Артем       | 200 | 3 | Воронеж              | 2001-12-01 00:00:00 | 10 |
| 58  | Журавлева  | Вера        | 0   | 4 | Новосибирск          | 2003-06-14 00:00:00 | 11 |
| 103 | Трофимов   | Владислав   | 250 | 5 | Верхоянск            | 1995-03-24 00:00:00 | 11 |
| 123 | Веселов    | Тимур       | 150 | 1 | Невинномысск         | 1998-04-28 00:00:00 | 11 |
| 126 | Жуков      | Пров        | 0   | 3 | Кыштым               | 1998-09-11 00:00:00 | 11 |
| 32  | Котов      | Павел       | 150 | 5 | Белгород             | 2001-02-28 00:00:00 | 14 |
| 57  | Кудряшова  | Вера        | 100 | 5 | Нижневартовск        | 2002-02-18 00:00:00 | 14 |
| 90  | Костина    | Кира        | 0   | 4 | Устюжна              | 1995-07-15 00:00:00 | 14 |
| 110 | Суханов    | Константин  | 250 | 3 | Курск                | 1996-11-22 00:00:00 | 14 |
| 118 | Кондратьев | Николай     | 150 | 3 | Ханты-Мансийск       | 1999-10-28 00:00:00 | 14 |
| 135 | Комаров    | Ипат        | 0   | 1 | Нерчинск             | 2000-07-17 00:00:00 | 14 |
| 149 | Вячеслав   | Пахомов     | 250 | 3 | Игарка               | 1997-05-14 00:00:00 | 14 |
| 202 | Владимиров | Анатолий    | 200 | 2 | Курск                | 2003-05-21 00:00:00 | 14 |
| 203 | Петрова    | Екатерина   | 250 | 4 | Белгород             | 2001-05-21 00:00:00 | 14 |
| 63  | Пак        | Ирина       | 100 | 1 | Магадан              | 2000-08-22 00:00:00 | 15 |
| 92  | Мельникова | Светлана    | 250 | 4 | Кропоткин (Краснод.) | 1998-03-24 00:00:00 | 15 |
| 61  | Соколова   | Ия          | 100 | 1 | Колпашево            | 2002-06-25 00:00:00 | 18 |
| 71  | Кондрат    | Синицин     | 200 | 4 | Ишим                 | 2001-02-23 00:00:00 | 18 |
| 77  | Мишина     | Светлана    | 150 | 2 | Рыльск               | 1997-05-22 00:00:00 | 18 |
| 89  | Валерия    | Овчинникова | 200 | 5 | Улан-Удэ             | 2000-06-15 00:00:00 | 18 |
| 124 | Юдин       | Савва       | 0   | 2 | Усинск               | 2001-12-02 00:00:00 | 18 |
| 139 | Журавлев   | Фома        | 200 | 2 | Улан-Удэ             | 1997-07-12 00:00:00 | 18 |
| 6   | Сидоров    | Вадим       | 150 | 4 | Москва               | 1999-06-07 00:00:00 | 22 |
| 74  | Гуляева    | Рукижат     | 0   | 3 | Невельск (Сахалин)   | 2002-07-23 00:00:00 | 22 |
| 75  | Игнатова   | Зинаида     | 100 | 5 | Ростов               | 2000-09-26 00:00:00 | 22 |
| 91  | Блохина    | Ираида      | 250 | 3 | Новый Уренгой        | 1997-03-23 00:00:00 | 22 |
| 105 | Антонов    | Анатолий    | 100 | 1 | Сыктывкар            | 1997-04-08 00:00:00 | 22 |
| 133 | Жуковский  | Юрий        | 150 | 4 | Сургут (Хант.)       | 1996-05-30 00:00:00 | 22 |
| 141 | Ершов      | Митрофан    | 250 | 5 | Пятигорск            | 2001-05-28 00:00:00 | 22 |
| 147 | Симонов    | Семен       | 100 | 5 | Беломорск            | 2000-03-17 00:00:00 | 22 |
| 201 | Архипов    | Андрей      | 180 | 1 | Орел                 | 2000-01-28 00:00:00 | 22 |
| 276 | Петров     | Антон       | 200 | 4 | Ульяновск            | 2001-08-05 00:00:00 | 22 |
| 79  | Афанасьева | Анжелика    | 0   | 2 | Уфа                  | 1996-11-22 00:00:00 | 32 |
| 85  | Казакова   | Мария       | 150 | 4 | Нальчик              | 1994-02-18 00:00:00 | 32 |
| 94  | Васильева  | Оксана      | 0   | 1 | Кизилюрт             | 1994-05-14 00:00:00 | 32 |
| 114 | Панов      | Арсений     | 250 | 1 | Геленджик            | 1996-12-23 00:00:00 | 32 |
| 130 | Кудряшов   | Роман       | 250 | 4 | Нижний Новгород      | 1997-08-26 00:00:00 | 32 |
| 136 | Ефимов     | Яков        | 200 | 1 | Тимашевск            | 2000-09-23 00:00:00 | 32 |
| 205 | Иванова    | Мария       | 200 | 1 | Липецк               | 2002-04-11 00:00:00 | 32 |
| 68  | Казакова   | Ольга       | 250 | 4 | Кемерово             | 2000-03-29 00:00:00 | 44 |
| 73  | Одинцова   | Лидия       | 100 | 5 | Верхний Баскунчак    | 2002-03-07 00:00:00 | 44 |
| 80  | Фролова    | Василиса    | 100 | 3 | Кисловодск           | 1999-06-02 00:00:00 | 44 |
| 104 | Бирюков    | Герасим     | 0   | 4 | Жуковский            | 1999-10-16 00:00:00 | 44 |
| 107 | Морозов    | Кирилл      | 250 | 2 | Кропоткин (Краснод.) | 2000-09-29 00:00:00 | 44 |
| 125 | Пономарев  | Варфоромей  | 200 | 4 | Улан-Удэ             | 2000-12-15 00:00:00 | 44 |
| 148 | Гуляев     | Кузьма      | 150 | 5 | Корсаков             | 1999-10-13 00:00:00 | 44 |
| 200 | Баранов    | Александр   | 220 | 2 | Москва               | 2001-08-18 00:00:00 | 44 |
| 204 | Петров     | Вадим       | 250 | 2 | Брянск               | 2002-05-21 00:00:00 | 44 |
| 206 | Киселев    | Владимир    | 210 | 2 | Орел                 | 2003-02-10 00:00:00 | 44 |
| 69  | Шубина     | Елена       | 0   | 2 | Камень-на-Оби        | 2002-08-24 00:00:00 | 45 |
| 82  | Лапина     | Элеонора    | 150 | 3 | Джубга               | 1997-11-23 00:00:00 | 45 |
| 95  | Сорокина   | Валерия     | 150 | 1 | Енисейск             | 1995-03-01 00:00:00 | 45 |
| 96  | Тимофеева  | Фаина       | 150 | 3 | None                 | 1999-08-01 00:00:00 | 45 |
| 207 | Миронова   | Федор       | 200 | 3 | Москва               | 2002-04-15 00:00:00 | 45 |
| 70  | Миронова   | Анна        | 200 | 2 | Владикавказ          | 2000-10-08 00:00:00 | 46 |
| 86  | Жукова     | Фекла       | 150 | 3 | Магадан              | 1998-10-06 00:00:00 | 46 |
| 97  | Вишнякова  | Анжела      | 200 | 2 | Иваново              | 2002-02-10 00:00:00 | 46 |
| 112 | Захаров    | Софон       | 150 | 3 | Мурманск             | 1994-03-19 00:00:00 | 46 |
| 121 | Воронова   | Антонина    | 0   | 4 | Усть-Джегута         | 1999-02-04 00:00:00 | 46 |
| 128 | Васильев   | Матвей      | 100 | 1 | Чебоксары            | 2000-07-18 00:00:00 | 46 |
| 137 | Кулаков    | Феофан      | 150 | 3 | Волоколамск          | 2001-03-14 00:00:00 | 46 |
| 140 | Ширяев     | Андрей      | 150 | 2 | Джубга               | 1997-09-13 00:00:00 | 46 |
| 144 | Ситников   | Викентий    | 150 | 5 | Иркутск              | 2003-10-05 00:00:00 | 46 |
| 64  | Жук        | Оксана      | 250 | 1 | Воркута              | 2000-11-16 00:00:00 | 47 |
| 108 | Назаров    | Икром       | 150 | 4 | Саянск               | 2001-12-15 00:00:00 | 47 |
| 117 | Лазарев    | Константин  | 100 | 2 | Славянск-на-Кубани   | 1998-05-22 00:00:00 | 47 |
| 131 | Ковалев    | Ефим        | 200 | 2 | Волгоград            | 1995-11-28 00:00:00 | 47 |
| 143 | Бирюков    | Мартин      | 100 | 4 | Курганинск           | 2000-11-14 00:00:00 | 47 |
| 146 | Русаков    | Давид       | 250 | 2 | Байкальск            | 1998-08-07 00:00:00 | 47 |
| 56  | Дуб        | Елизавета   | 150 | 2 | Усть-Кут             | 2004-07-04 00:00:00 | 48 |
| 60  | Рожкова    | Пелагея     | 0   | 3 | Рубцовск             | 2001-09-15 00:00:00 | 48 |
| 72  | Пономарева | Алина       | 250 | 2 | Ангарск              | 2002-10-07 00:00:00 | 48 |
| 83  | Сорокина   | Ирина       | 200 | 3 | Усмань               | 1993-09-28 00:00:00 | 48 |
| 101 | Калашников | Евгений     | 200 | 2 | Калининград          | 1998-02-27 00:00:00 | 48 |
——————————————————————————————————————————————————————————————————————————————————————————————

# Домашнее задание

1. Выполнить отображение БД Chinook

<img src="../Img/chinook_ERD.png" style="width:100%">

2. Выполнить запросы с помощью подзапросов.

2.1. Составьте запрос, выполняющий вывод информации о счетах клиентов из Бразилии. Результат должен содержать фамилию и имя клиента, идентификатор счета, дату выставления счета, название страны плательщика (Billing Country).

2.2. Покажите сотрудников, подчиняющихся сотруднику *Nancy Edwards*.

2.3. Покажите трэки в жанре *Classical*, длящиеся более 8 минут.

2.4. Покажите альбомы, в составе которых более 25 трэков.

2.5. Покажите жанры, в составе которых имеются трэки, длящиеся более 18 минут.

2.6. Покажите артистов в жанре *Classical*.

2.7. Найдите артистов, записавших альбомы, в которых более 20 произведений.

In [1]:
from sqlalchemy import MetaData, Table, create_engine, select, and_, or_, not_
from sqlalchemy.sql import func

In [2]:
engine = create_engine('sqlite:///../Data/Chinook_Sqlite.sqlite')
metadata_obj = MetaData() # Объект-контейнер, содержит информацию о схеме данных
metadata_obj.reflect(bind=engine) # Отображение БД
# Вызов метода reflect() приводит к включению в объект metadata_obj словаря всех таблиц БД.

In [25]:
employee=Table("Employee", metadata_obj, autoload=True, autoload_with="engine")
customer = Table("Customer", metadata_obj, autoload=True, autoload_with="engine")
invoice = Table("Invoice", metadata_obj, autoload=True, autoload_with="engine")
genre=Table("Genre", metadata_obj, autoload=True, autoload_with="engine")
track=Table("Track", metadata_obj, autoload=True, autoload_with="engine")
album = Table("Album", metadata_obj, autoload=True, autoload_with="engine")
artist = Table("Artist", metadata_obj, autoload=True, autoload_with="engine")
#university=Table("university", metadata_obj, autolad=True, autolad_with="engine")

In [6]:
conn=engine.connect() # Соединение

In [ ]:
def select_all_tables(conn, sql_sent):
    
    cursor = conn.execute(sql_sent)
    
    rows = cursor.fetchall()
    
    if len(rows) == 0:
        print("По такому запросу данных в БД нет.")
        return 0
    
    len_elm = [max([len(str(row[el])) for row in rows]) for el in range(len(rows[0]))]
    answer_len = 4+(len(len_elm)-1)*3+sum(len_elm)
    
    print("—"*answer_len)
        
    for index in range(len(rows)):
        row = rows[index]
        print("|", end='')
        for elem in range(len(row)):
            print(" " + str(row[elem]).ljust(len_elm[elem]) + " |", end='')
        print()
    print("—"*answer_len)

In [ ]:
'''
Покажите сотрудников, подчиняющихся сотруднику Nancy Edwards.
'''

SELECT * FROM Employee
where ReportsTo = (
    select EmployeeId from Employee where LastName = 'Edwards' and FirstName = 'Nancy')
    order by EmployeeId;

In [11]:
sq = select(employee.c.EmployeeId)
sq = sq.where(employee.c.LastName == 'Edwards' and employee.c.FirstName == 'Nancy').scalar_subquery()


s = select(employee.c.EmployeeId, employee.c.LastName, employee.c.FirstName)
s = s.where(employee.c.ReportsTo == sq)
s = s.order_by(employee.c.EmployeeId)

print(s)


result = conn.execute(s).fetchall()
print(len(result))
select_all_tables(conn, s)

SELECT "Employee"."EmployeeId", "Employee"."LastName", "Employee"."FirstName"
FROM "Employee"
WHERE "Employee"."ReportsTo" = (SELECT "Employee"."EmployeeId"
FROM "Employee"
WHERE "Employee"."LastName" = :LastName_1) ORDER BY "Employee"."EmployeeId"
3
——————————————————————————
| 3 | Peacock | Jane     |
| 4 | Park    | Margaret |
| 5 | Johnson | Steve    |
——————————————————————————

In [ ]:
'''
Покажите трэки в жанре Classical, длящиеся более 8 минут.
'''

SELECT * FROM Track
where GenreId = (
    select GenreId from Genre where Name = 'Classical') and Milliseconds > 60*8*1000
    order by GenreId;

In [27]:
sq = select(genre.c.GenreId)
sq = sq.where(genre.c.Name == 'Classical').scalar_subquery()


s = select(track.c.TrackId, track.c.Milliseconds)
s = s.where(track.c.GenreId == sq, track.c.Milliseconds > 480000)
s = s.order_by(track.c.GenreId)

print(s)


result = conn.execute(s).fetchall()
print(len(result))
select_all_tables(conn, s)

SELECT "Track"."TrackId", "Track"."Milliseconds"
FROM "Track"
WHERE "Track"."GenreId" = (SELECT "Genre"."GenreId"
FROM "Genre"
WHERE "Genre"."Name" = :Name_1) AND "Track"."Milliseconds" > :Milliseconds_1 ORDER BY "Track"."GenreId"
11
—————————————————
| 3404 | 501503 |
| 3410 | 582029 |
| 3423 | 522099 |
| 3425 | 596519 |
| 3432 | 545203 |
| 3434 | 560342 |
| 3440 | 483133 |
| 3445 | 526696 |
| 3446 | 561967 |
| 3485 | 567494 |
| 3498 | 493573 |
—————————————————

In [ ]:
'''
Покажите альбомы, в составе которых более 25 трэков.
'''

In [29]:

sq = select(func.count(track.c.TrackId))
sq = sq.where(track.c.AlbumId == album.c.AlbumId).scalar_subquery()


s = select(album)
s = s.where(sq > 25)
s = s.order_by(album.c.AlbumId)

print(s)


result = conn.execute(s).fetchall()
print(len(result))
select_all_tables(conn, s)

SELECT "Album"."AlbumId", "Album"."Title", "Album"."ArtistId"
FROM "Album"
WHERE (SELECT count("Track"."TrackId") AS count_1
FROM "Track"
WHERE "Track"."AlbumId" = "Album"."AlbumId") > :param_1 ORDER BY "Album"."AlbumId"
4
——————————————————————————————
| 23  | Minha Historia | 17  |
| 73  | Unplugged      | 81  |
| 141 | Greatest Hits  | 100 |
| 229 | Lost, Season 3 | 149 |
——————————————————————————————

In [ ]:
'''
Покажите жанры, в составе которых имеются трэки, длящиеся более 18 минут.
'''

In [30]:

sq = select(track.c.GenreId)
sq = sq.where(track.c.Milliseconds > (1000 * 60 * 18)).scalar_subquery()


s = select(genre)
s = s.where(genre.c.GenreId.in_(sq))
s = s.order_by(genre.c.GenreId)

print(s)


result = conn.execute(s).fetchall()
print(len(result))
select_all_tables(conn, s)

SELECT "Genre"."GenreId", "Genre"."Name"
FROM "Genre"
WHERE "Genre"."GenreId" IN (SELECT "Track"."GenreId"
FROM "Track"
WHERE "Track"."Milliseconds" > :Milliseconds_1) ORDER BY "Genre"."GenreId"
6
—————————————————————————
| 1  | Rock             |
| 18 | Science Fiction  |
| 19 | TV Shows         |
| 20 | Sci Fi & Fantasy |
| 21 | Drama            |
| 22 | Comedy           |
—————————————————————————

In [ ]:
'''
Покажите артистов в жанре Classical.
'''

In [32]:

sq = select(track.c.Composer)
sq = sq.where(track.c.Composer == artist.c.Name and genre.c.Name == "Classical").scalar_subquery()


s = select(artist)
s = s.where(artist.c.Name == sq)
s = s.order_by(artist.c.ArtistId)

print(s)


result = conn.execute(s).fetchall()
print(len(result))
select_all_tables(conn, s)

SELECT "Artist"."ArtistId", "Artist"."Name"
FROM "Artist"
WHERE "Artist"."Name" = (SELECT "Track"."Composer"
FROM "Track"
WHERE "Track"."Composer" = "Artist"."Name") ORDER BY "Artist"."ArtistId"
47
———————————————————————————————
| 1   | AC/DC                 |
| 7   | Apocalyptica          |
| 10  | Billy Cobham          |
| 12  | Black Sabbath         |
| 14  | Bruce Dickinson       |
| 15  | Buddy Guy             |
| 16  | Caetano Veloso        |
| 17  | Chico Buarque         |
| 19  | Cidade Negra          |
| 24  | Marcos Valle          |
| 27  | Gilberto Gil          |
| 34  | Nando Reis            |
| 42  | Milton Nascimento     |
| 46  | Jorge Ben             |
| 50  | Metallica             |
| 51  | Queen                 |
| 54  | Green Day             |
| 55  | David Coverdale       |
| 56  | Gonzaguinha           |
| 59  | Santana               |
| 68  | Miles Davis           |
| 80  | Djavan                |
| 81  | Eric Clapton          |
| 82  | Faith No More         |
| 84  | Foo Fighters          |
| 91  | James Brown           |
| 94  | Jimi Hendrix          |
| 97  | João Suplicy          |
| 100 | Lenny Kravitz         |
| 101 | Lulu Santos           |
| 104 | Marvin Gaye           |
| 108 | Mônica Marianno       |
| 110 | Nirvana               |
| 118 | Pearl Jam             |
| 124 | R.E.M.                |
| 127 | Red Hot Chili Peppers |
| 132 | Soundgarden           |
| 138 | The Clash             |
| 143 | The Tea Party         |
| 145 | Tim Maia              |
| 146 | Titãs                 |
| 150 | U2                    |
| 152 | Van Halen             |
| 199 | Karsh Kale            |
| 202 | Aaron Goldberg        |
| 205 | Chris Cornell         |
| 240 | Gustav Mahler         |
———————————————————————————————

In [ ]:
'''
Найдите артистов, записавших альбомы, в которых более 20 произведений.
'''
SELECT * FROM Artist
where Artist.ArtistId in (
    SELECT Album.ArtistId from Album
    WHERE (
        select count(*) from Track 
        WHERE Track.AlbumId = Album.AlbumId)>25)

In [36]:
sq2 = select(func.count(track.c.TrackId))
sq2 = sq2.where(track.c.AlbumId == album.c.AlbumId).scalar_subquery()

sq = select(album.c.ArtistId)
sq = sq.where(sq2 > 25).scalar_subquery()

s = select(artist)
s = s.where(artist.c.ArtistId.in_(sq))
s = s.order_by(artist.c.ArtistId)

print(s)


result = conn.execute(s).fetchall()
print(len(result))
select_all_tables(conn, s)

SELECT "Artist"."ArtistId", "Artist"."Name"
FROM "Artist"
WHERE "Artist"."ArtistId" IN (SELECT "Album"."ArtistId"
FROM "Album"
WHERE (SELECT count("Track"."TrackId") AS count_1
FROM "Track"
WHERE "Track"."AlbumId" = "Album"."AlbumId") > :param_1) ORDER BY "Artist"."ArtistId"
4
———————————————————————
| 17  | Chico Buarque |
| 81  | Eric Clapton  |
| 100 | Lenny Kravitz |
| 149 | Lost          |
———————————————————————